# Pandas : 
explore data , manipulate data and get it ready for Data Analysis <br>

<b>Why Pandas ?</b> <br>
>Simple to use <br>
> Integrated with many other data science & Ml python tools<br>
> Helps you get data ready for machine learning<br>


<b>What are we going to cover in this section :</b> <br>
>Most useful functions<br>
>Pandas Datatypes<br>
>Importing & exporting data<br>
>Describing data ## statiscally <br>
>Viewing & selecting data<br>
>Manipulating data<br>

In [1]:
import pandas as pd ##importing Pandas in jupyter notebook

In [2]:
# 2 main data Types
series = pd.Series(["BMW","HONDA","AUDI"]) ## here after pd.(Series "S" should be capital)

In [3]:
series ## series is a 1D <column>

0      BMW
1    HONDA
2     AUDI
dtype: object

In [4]:
colours = pd.Series(["RED","Yellow","BLUE"])
colours

0       RED
1    Yellow
2      BLUE
dtype: object

In [5]:
#DataFrame is 2 dimesional 
##More oftern used
## It takes a Python Dictionary
car_data = pd.DataFrame({"car make "  : series,"Colour":colours})
car_data

  car make   Colour
0       BMW     RED
1     HONDA  Yellow
2      AUDI    BLUE

In [6]:
## Import Data
car_sales = pd.read_csv ("car-sales.csv")
car_sales
#reading car-sales.csv to the variable car_sales
#csv = comma seperated values
#row is reffered to axis  = 0 
#column is referred to axis  =1
#the contents of this tables are called Data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
#Exporting a DataFrame
car_sales.to_csv("exported-car-sales.csv")
#can also export it to excel by  .to_excel

In [8]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 36A3-5FA6

 Directory of C:\Users\test\Desktop\ML_Sample_UdemyCourse

11/04/2020  03:54 PM    <DIR>          .
11/04/2020  03:54 PM    <DIR>          ..
11/03/2020  11:46 PM                 3 .gitignore
11/04/2020  02:48 PM    <DIR>          .ipynb_checkpoints
11/03/2020  05:49 PM           332,025 6-step-ml-framework.png
11/04/2020  02:51 PM               369 car-sales.csv
11/03/2020  05:22 PM               116 debug.log
11/03/2020  03:04 PM    <DIR>          env
11/04/2020  03:54 PM               392 exported-car-sales.csv
11/03/2020  05:49 PM            11,328 heart-disease.csv
11/04/2020  02:35 PM            18,381 JupyterWalkthrough1.ipynb
11/04/2020  03:52 PM            12,784 Pandas1.ipynb
11/04/2020  03:03 PM           341,236 pandas-anatomy-of-a-dataframe.png
               9 File(s)        716,634 bytes
               4 Dir(s)  863,158,411,264 bytes free

In [9]:
car_sales.to_csv("exported-indexFalsed-car-sales.csv",index = False)
car_sales.to_csv("exported-indexTrue-car-sales.csv",index = True)##adding an index column
# here we are telling python that no need to add an 
#extra column for indexing <by default index = False>

In [12]:
sales_car = pd.read_csv("exported-indexFalsed-car-sales.csv")
sales_car_True = pd.read_csv("exported-indexTrue-car-sales.csv")

In [11]:
sales_car

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [14]:
sales_car_True

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00